# Selecting Data from a Table

Learn how to query data from a table in MySQL using the SELECT statement, filter results using the WHERE clause, and apply different comparison operators, including working with NULL values.

## 1. Basic SELECT Statement

In [ ]:
SELECT * FROM student;  -- Retrieve all data
SELECT name, grade FROM student;  -- Retrieve specific columns

## 2. Using the WHERE Clause

In [ ]:
SELECT * FROM student WHERE grade = '10th';
SELECT * FROM student WHERE age > 16;

## 3. Comparison Operators in MySQL

| Operator | Description                | Example                          |
|----------|----------------------------|----------------------------------|
| =        | Equals                     | WHERE age = 16                   |
| !=       | Not equal to               | WHERE grade != '12th'           |
| <>       | Not equal to (alternative) | WHERE grade <> '12th'           |
| >        | Greater than               | WHERE age > 16                  |
| <        | Less than                  | WHERE age < 17                  |
| >=       | Greater than or equal to   | WHERE age >= 16                 |
| <=       | Less than or equal to      | WHERE age <= 18                 |
| BETWEEN  | Within a range             | WHERE age BETWEEN 15 AND 17     |
| IN       | Matches any in a list      | WHERE grade IN ('10th', '12th') |
| NOT IN   | Excludes list items        | WHERE grade NOT IN ('9th')      |
| LIKE     | Pattern matching           | WHERE name LIKE 'A%'            |
| NOT LIKE | Pattern not matching       | WHERE name NOT LIKE '%a'        |

## 4. Handling NULL Values

In [ ]:
-- Incorrect
SELECT * FROM student WHERE grade = NULL;  

-- Correct
SELECT * FROM student WHERE grade IS NULL;
SELECT * FROM student WHERE grade IS NOT NULL;

## 5. Combining Conditions

In [ ]:
SELECT * FROM student WHERE grade = '10th' AND age > 16;
SELECT * FROM student WHERE grade = '9th' OR grade = '12th';
SELECT * FROM student WHERE (grade = '10th' OR grade = '11th') AND age >= 16;

## 6. Sorting Results with ORDER BY

In [ ]:
SELECT * FROM student ORDER BY age ASC;
SELECT * FROM student ORDER BY name DESC;

## 7. Limiting Results with LIMIT

In [ ]:
SELECT * FROM student LIMIT 5;
SELECT * FROM student LIMIT 2, 5;

## 8. Using Wildcards with LIKE

Two wildcards in MySQL:
- `%` – Matches zero or more characters
- `_` – Matches exactly one character

In [ ]:
SELECT * FROM students WHERE name LIKE 'A%';

### Matching Dates with _ Wildcard

In [ ]:
SELECT * FROM attendance WHERE date LIKE '____-__-05';

### More Date Pattern Examples

| Pattern        | Matches                            |
|----------------|-------------------------------------|
| '2025-05-%'    | Any day in May 2025                |
| '2024-12-__'   | All 2-digit days in December 2024  |
| '____-01-01'   | 1st January of any year            |
| '202_-__-__'   | Any date in the 2020s decade       |
| '____-__-3_'   | All dates from day 30 to 39        |

### Quick Recap: LIKE Wildcard Matching

| Pattern         | Meaning                        |
|----------------|----------------------------------|
| 'A%'           | Starts with A                   |
| '%sh'          | Ends with sh                    |
| '%ar%'         | Contains “ar”                   |
| 'R____'        | 5-letter name starting with R   |
| '____-__-05'   | Dates with day = 05             |